# ===========================================================================
# Brewfile — declarative package manifest
# Install: brew bundle
# Check what's not listed: brew bundle cleanup
# ===========================================================================

# ── Shell & Terminal ─────────────────────────────────────────────────────────
brew 'starship'                  # prompt (configured in starship/starship.toml)
brew 'zsh-autosuggestions'       # fish-like suggestions
brew 'zsh-syntax-highlighting'   # command highlighting
brew 'fzf'                       # fuzzy finder (Ctrl+R, file search, etc.)

# ── Core CLI Tools ───────────────────────────────────────────────────────────
brew 'git'
brew 'gh'                        # GitHub CLI (used for git credential auth)
brew 'vim'
brew 'neovim'
brew 'tree'
brew 'htop'
brew 'wget'
brew 'jq'                        # JSON processor
brew 'ripgrep'                   # fast grep alternative (rg)
brew 'shellcheck'                # shell script linter
brew 'shfmt'                     # shell script formatter

# ── Python ───────────────────────────────────────────────────────────────────
brew 'uv'                        # Python package/project manager (replaces pip, rye, pdm)

# ── Data & Geospatial ───────────────────────────────────────────────────────
brew 'duckdb'
brew 'gdal'                      # geospatial data abstraction library
brew 'sqlite'
brew 'graphviz'                  # graph/diagram rendering

# ── Document & Media ─────────────────────────────────────────────────────────
brew 'pandoc'                    # document conversion (markdown, LaTeX, docx, etc.)
brew 'imagemagick'
brew 'ffmpeg'                    # video/audio processing

# ── Cloud ────────────────────────────────────────────────────────────────────
brew 'awscli'                    # AWS (S3, cloud-native geospatial data)
# brew 'azure-cli'              # uncomment if you need Azure

# ── Misc ─────────────────────────────────────────────────────────────────────
brew 'unar'                      # universal archive extraction

# ── Apps ─────────────────────────────────────────────────────────────────────
cask 'ghostty'                   # earerminal
cask 'firefox'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'obsidian'                  # notes
cask 'zotero'                    # reference manager
cask 'signal'
cask 'spotify'
cask 'skim'                      # PDF viewer (LaTeX synctex support)
cask 'miniforge'                 # conda for geospatial Python envs (GDAL, rasterio)
cask 'qbittorrent'
cask 'vlc'

# ── Proton Suite ─────────────────────────────────────────────────────────────
cask 'proton-mail'
cask 'proton-drive'
cask 'proton-pass'
cask 'protonvpn'

# ── Communication ────────────────────────────────────────────────────────────
cask 'slack'
cask 'zoom'
# cask 'microsoft-teams'         # uncomment if needed for work

# ── LaTeX ────────────────────────────────────────────────────────────────────
cask 'mactex'                  # full LaTeX distribution (~5GB). Uncomment if writing papers.

# ── Fonts ────────────────────────────────────────────────────────────────────
cask 'font-jetbrains-mono-nerd-font'

# ── Mac App Store (requires `mas` CLI) ───────────────────────────────────────
# brew 'mas'
# mas 'Magnet', id: 441258766   # window management (already purchased)
