firefox
google-chrome
iterm2
protonmail-bridge
protonvpn
rectangle
signal
skim
spotify
visual-studio-code
zotero
obsidian
vmware-horizon-client
visual-studio-code
microsoft-teams
zoom
adobe-acrobat-reader
clickshare
microsoft-edge
cask google-earth-pro
slack
ngrok
soulseek
